{
    "children": [
        {
            "children": [
                {
                    "name": "categorizing", 
                    "sentences": [
                        "+1    This is absolutely horrible. Id rather be back on QuickBooks 2009 for Windows where downloading transactions actually worked and you could categorize transactions quickly. This wastes so much more time now, the AMEX UI for categorizing is pathe", 
                        "I also need to search by Country as well !", 
                        "When I travel Abroad I can see which customer I can visit in a specific Country", 
                        "Thanks", 
                        "I want this feature back so bad.  We have many customers with sub-locations.  The new way is such a pain to lookup our customers information  get the right one.", 
                        "I want to generate report of Invoices with Location group and listing of class, and all invoices including split invoices.", 
                        "Someone please help me.", 
                        "Yes Please....     I have thousands of products and its crazy that I cant look up products by using the description column either. Ive put up with it for years but I as soon as I find an alternative its goodbye Quickbooks. "
                    ]
                }, 
                {
                    "name": "download_transactions", 
                    "sentences": [
                        "+3.  Its more than messy looking!  For those many users who do not have bank connectivity (and thus are manually updating bank statements), any error = a major headache  reporting confusion!\n\nIf a duplicate bank statement is added by error, ther", 
                        "Add ability to see downloaded transactions with register view.", 
                        "I am having the same issues with multiple downloads from bank feeds.  This is a pain and in my view  seems to be a fault with the programme if others are having the same issues. I often just have to  give the entry a zero value just to get rid of it.  The", 
                        "Please at least give us the option to keep old format. Transactions from January and Feb. dont match my bank. None of the expense categories were captured!!! I had to manually re-enter. Bank downloads do not work as well. Not happy."
                    ]
                }
            ], 
            "name": "report"
        }, 
        {
            "name": "payroll", 
            "sentences": [
                "Agree - had a client already on Intuit Online Payroll Accts Wholesale, finally convinced them to use QuickBooks Online but now they are paying double.  Should be a way to pull in existing Intuit Online Payroll into a QuickBooks Online account.", 
                "Great article link below that addresses most of the issues described. The only one it does not is how to get payroll into QBO allocated to jobs. We use Enter bills, enter the items, the hours and the rate down below in Item Details", 
                "I absolutely agree.  This drives me nuts and wastes my time.  Ive actually wasted deposit slips and deposited one check at a time, if you can believe it, trying to split my deposit myself so I dont run into this issue.", 
                "I couldnt agree more!  Was on the phone for 51 minutes with support today to find out that what I need from Quickbooks Online Payroll is no longer available.  Payroll usually takes me 6 minutes, tops!  I am so frustrated and looking at other payroll ", 
                "I have been begging QBO to block cash flow information from limited users.  It took me a few days before I even realized they could see this information in a big green box  by that time I had short  long term employees looking for a raise.  Now ", 
                "If we were using a metaphor to compare QBO payroll to QB-PC payroll, QBO would be like using an old rotary phone and QB-PC would be like using the latest i-Phone.", 
                "No Kidding. I waited at least one minute watching that stupid blue circle spinning.. FOR ONE PAYCHECK! We have 35 employees. You do the math :(", 
                "New Version = Time Suck", 
                "No, put the payment type field in just like the desktop version. Its a weekly timesheet  screen so it should allow the choice of vacation, regular, OT, Double ot, sick days, etc.", 
                "", 
                "Taking away this feature has completely messed up the way we do payroll! There needs to be an approval page that we can refer back to before the checks are submitted!! ", 
                "This needs to be done ASAP, payroll is now a nightmare!", 
                "When we enter the employees time in the time sheet, they generally have more than 40 hours.  We have to back and manually move the OT hours to the OT field for each employee.  We are in the construction industry. In the summer, we may have from 20 to", 
                "Would like to be able to file payroll taxes without paying, if necessary and to make a partial payment if necessary when paying through QB."
            ]
        }, 
        {
            "children": [
                {
                    "name": "recurring_billing", 
                    "sentences": [
                        "I agree totally,  we are a Landscape company and we desperately need to be able to have progressive billing.", 
                        "I keep getting these updates to this thread a year after I dropped QBO..They even offered  me one year at 1/2 price...But until they fix the invoice problems including the field issues and progress payment invoicing I certainly wont be back.", 
                        "In working with the invoices set up for our customers who have payment plans I quickly saw what an inaccurate picture of our accounts receivable this paints.  As a lover of QB/Intuit, I too am shocked this function is not included.  I made note of some of", 
                        "Recurring billing is the underlying cash flow of a business. First, you removed it from being connected to the client so we can make sure that each client has their recurring billing.  You made it so that we have to recreate all of them in order to set th"
                    ]
                }, 
                {
                    "name": "payment", 
                    "sentences": [
                        "ABSOLUTE MUST. Without multiple currency handling in US version, we will need to switch out of QBO.", 
                        "Absolutely! There is too much risk exposure (big fees) in making us turn off CC for each invoice. It should be a global setting for on/off for each type of payment.", 
                        "I agree. The old version of quickbooks had a link to the IPN and now we have to log in separately to pay bills. It should be easier to pay bills, just like it is easy to have a customer pay an invoice online and have direct deposit for employees. Please f", 
                        "I need to be be able to invoice for all unbilled activities.  Its ridiculous that I have to invoice hundreds of clients one at a time.  This was a time saving feature in the older version that I really liked.  By the way, I completely despise the new", 
                        "PLEase add this functionality of multi currency to the online US version!!!  Totaly essential", 
                        "The emailed invoices show only the current amount due.  If you click on view invoice it will show the correct amount due with past due amounts forwarded.  BUT, if you click to pay you are not allowed to pay a penny above the current invoiced amount.  WHAT", 
                        "This also applies to multi-currency items. I used to have unpaid bills totals in original currency in desktop version. Now i need to add various invoices to be able to pay in the right currency. Same applies to the bank items on TB. Total bank is correct ", 
                        "This multi currency functionality is VERY important for US corporations.  PLease add ASAP!!", 
                        "Yeah I have the same issue.  This is ridiculous that there isnt a way to refund an overpayment.  Even a check wont work because it doesnt let me take the money from the undeposited funds."
                    ]
                }, 
                {
                    "name": "customization", 
                    "sentences": [
                        "Adding spaces is HUGE for me. I need to be able to organize my invoices in sections for the client. Being able to add text in description field without having to add a new full line item is important too so I can categorize the section. \n\nAlso", 
                        "Allow the row height on invoices to be customizable so that a description that is longer than one line can actually be read by the client!", 
                        "Also add ability to more customize the invoice.", 
                        "For our business, a proper size logo on the invoice is important for branding. The layout as at 2 July 2014 is mickey mouse. I also dont want payment and balance due showing on our particular invoices. Currently very disappointed ", 
                        "I have been a QB user for a number of yrs on desktop version, thought I wanted to try and move a client to the QBOA version =(  but i cant move the client I wanted due to the constraints on the customization of Invoicing.  PLEASE PLEASE bring the QBOA cus", 
                        "I have just started using the online version, and I am very disappointed in the comparison on my desktop version.  We need more than 3 special text boxes on our invoice, and the ability to place the text boxes in order.  ", 
                        "I hope all the comments below is enough for QB to realise the importance of template customisation and make this a PRIORITY!", 
                        "I NEED TO BE ABLE TO INPUT A FUEL SURCHARGE IN MY INVOICES.  WHILE USING QUICKBOOKS PRO I HAD NO ISSUES NOW THAT IM USING ONLINE ITS NOT AVAILABLE.........THIS MAKES INVOICING MUCH MORE TIME CONSUMING BECAUSE I HAVE TO ADD IT TO EACH INDIVIDUAL CHARG", 
                        "I spent a very long and tedious time customizing my invoice with my desktop version to not have it transfer to the online version.  I will be going back to desktop until it is possible.  I do not want to confuse my clients or change our representation to ", 
                        "I would like to be able to have different templates for my Invoices and Estimates", 
                        "Im very unhappy with the new way my invoices print in Quickbooks online since the update.  I had it set up with the columns I needed  now it has add a price per hour  hours.  I would like to be able to customize for our business!\n ", 
                        "Invoices are a very big representation of our Company. The templates and customization we are given to work with are substandard.  Not one of these templates allow us to center or re-size our logo (which, by the way, is way too small) and we liked the loo", 
                        "Please allow more custom fields on the invoice. Three is not enough. Also, the ability to set the input type for each field (such as date, a dropdown list created by the user, number, etc.) would be HUGE. Thank you. ", 
                        "Please can you look into allowing us to add customer telephone numbers on invoices. every other accounting package allows this and it is causing us endless problems", 
                        "Terrible mistake bypassing invoice customization!  What a JOKE!! I would never send out one of their 5 templates available.\n\nMore like a kids ipad game than a professional full featured software.  ", 
                        "The current Invoices quality and customisation  are unacceptable. Have to do everything double because I cant sent my customers the invoices generated in QBO.They look very unprofessional.\ndouble print of ABN number, cuts text of my footer, layout se", 
                        "Totally agree with Tami. the lack of template customisation is what is holding me back from switching from QB Desktop. Invoicing is the priority for my business and until this is improved on the online version i will be sticking to the desktop version."
                    ]
                }, 
                {
                    "name": "format", 
                    "sentences": [
                        "Can you please create ability to add a Units column to invoices?  I have wanted this ability ever since I started using QB Online over 4 years ago.  Please.", 
                        "Completely agree with other userss comments. Delayed charges should automatically appear on invoices (or make this a preference we can enable).\n\nIn addition, delayed charges should also be included in the unbilled activity total  list. This was ", 
                        "Customer should be able to see invoice detail on statement and make an online payment of balance tota", 
                        "doesnt seem too much to ask to just add custom columns to invoices. im simply trying to add an MSRP column to invoices. FAIL. ", 
                        "I agree with many of the comments below.  To begin with the online version of quickbooks has always had weak invoicing compared to the desktop version.  I realize you are working on this.  But how long does it take?  In addition, you have taken away some ", 
                        "I am going to lose clients if I cannot Subtotal services and expenses on my invoices!! They are simply not paying if not subtotaled", 
                        "I am going to lose clients if I cannot Subtotal services and expenses separately on my invoices!! Clients are simply not paying if not subtotaled the invoice is being returned!!", 
                        "I am very disappointed that the subtotal invoice feature has been removed for those that do no charge sales tax. ", 
                        "I have multiple client bases. I need to use a different my email for each... and would actually rather NOT show my email on an invoice. Please let me REMOVE  my email from the invoice.", 
                        "I have two companies in QB.  One was converted to online over a year ago (roughly March 2013).  My second company converted on June 1st 2014.  When my first company converted I noticed that invoice customization such as line breaks and subtotaling of serv", 
                        "I just want to simply add a blank line to separate my invoice items.  The answer provided does not address this simple request.  I was able to do this in the old online version.", 
                        "I need the same ting to Format Invoice", 
                        "I totally agree with this request. I think it is a HUGE omission from QBO. What is needed is a key-word(s) and the ability to add/subtract as well.\n\ne.g. in an invoice description field:   Monthly charges for ::month-1::, ::year::  should outp", 
                        "I work in Hawaii where General Excise Tax IS NOT SALES TAX, it is income.  State law allows a business to uplift an invoice to to recover the impact of the tax.  In QB I could use a sub-total item to sum goods and services, then apply the excise tax uplif", 
                        "Ian - Stop complaining!  Are you kidding me?  The new QBO has some serious issues that has cost me thousands.  Emailed invoices only show current amount due, not previous amounts due.  Sure, you can click view invoice and QB will allow you to see the corr", 
                        "Im in desperate need of sub totals in Quickbooks Online Plus!", 
                        "In addition to subtotaling expenses versus time, the new version is no longer printing the retainer fee we have already received in the Balance Forward section and sometime is not showing payments received.  Our customers are very confused by ", 
                        "In addition, all historic invoices prior to this update, would require to be recreated since this grouping is not allow.", 
                        "Just moved across to quickbooks online and incredibly disappointed in how unprofessional our invoices now look, VAT registration number across two rows (etc).  Incredibly limited functionality for improving the look and detail and from reading the comment", 
                        "My clients are refusing to pay for services because I cannot Subtotal services and expenses on my invoices!!", 
                        "Not only to have a sales rep section for their name but an email as well. Estimates and Sales orders tend to go to the sales person while invoices go to someone different in Accounting. PLEASE, this would help out so much.", 
                        "Please add back the feature to email invlice to my own address, not theirs. Sometimes I have to attach other documents, or I just want to attach a pdf invoice to an email sent through my own system, customized/personalized for the situation.", 
                        "QBO Admin marked this feature request as COMPLETED in Nov 2013.. but I disagree, it is NOT completed.\n\nThe Save and send button on the invoice screen is still sending the invoice immediately without warning and without giving the user a chance to edit or ", 
                        "Really need the old subtotal by type function back. Many of our clients require us to break out charges v expenses v time activity and the new version does not allow this.", 
                        "really need to have the Clients info..phone number on printed estimates, invoices", 
                        "Statements are cutting off the bottom of the footers.  We need to be able to make adjustments to the statement as well as invoices. \n\nWe should be able to add late fees in the bottom part of the invoice or statement, rather than as an activity line item. ", 
                        "Subtotals are essential to any type of business that sells parts and labor as separate line items. ", 
                        "Subtotals within an invoice is very important to us.  We used it all the time on the desktop version.", 
                        "SUBTOTALS!!!  If I cannot Subtotal services and expenses separately on my invoices, clients will not pay the invoices are being returned!!", 
                        "Terminology for not for profit organization should not be net profit or loss, but instead excess of income over expenses, etc.  Heading in Balance Sheet should read LIABILITIES AND FUND BALANCE....under that then Fund Balance and Excess Revenues (deficit)", 
                        "thats great news that its under way. id like to add that we would like to be able to have sub sections in our estimates and invoices with sub totals, based on our own groupings.\n(ie - design group, bunch of design line items, design sub total; on site hel", 
                        "The online version of QB is absolutely horrible when it comes to generating PDF versions of invoices! Its embarrassing sending invoices from this system. Not professional at all. When will this be updated??? PLEASE!!!!", 
                        "The standard invoices look VERY unprofessional.  After tweaking it for 3 hours, it still does not line up or look professional and polished.  Very disappointing, as it makes my business look bad to the very clients who are paying me!  Plus the", 
                        "The updates to-date are not even close to where this needs to be. Im creating dual invoices now because I cant send my clients the invoices that come out of QBO. Very unprofessional and I need to add in my own content. Pair up with Google Docs o", 
                        "This is a critical option.  Without a subtotal item i cant provide my customers with their interior and exterior prices. ", 
                        "This is an essential feature that needs to be brought back.  many companies are spending hours to recreate a historical invoice the way it appeared in the classic system.  ", 
                        "This is soooo frustrating!! When an invoice is marked as paid, I assume it is paid! Should not have to go double check every single invoice to see if the PAID is really DECLINED!! No fix yet????", 
                        "This upgrade is atrocious. Sub-customer info is not being fed up to the parent customer. Not only the $ subtotals but when you try to batch invoice unbilled activity, it does not pick up sub-customer billable charges. This is a disaster.", 
                        "Vendor needs to be associated with the items received on the invoice. The field also needs to be included in the inventory reports so that you can group and sort by vendor.\n\nRight now, it is really hard to evaluate inventory changes from the moment an ite", 
                        "We really need this feature.  It was in the desktop and I used it on many invoices.  Takes two to three times as long to post a payment in this version as in the desktop version.  Time is money and a lot of time is wasted in work arounds", 
                        "Where is the ability to choose the from details for email messages sent through QBOs new Harmony portal?\n\nMy emailed invoices from field switched to my company name (from My Name [w/ personalized address] to Company Name [w/ donot", 
                        "Why is this not available online?  I have been using QB for years and used this feature on every estimate I have sent out.  Why take away functionality that is so essential and so easy to code?  Please add this!!!", 
                        "yes, yes, yes. We need subtotals and mark-ups on invoices as well...", 
                        "Yes... we bill time as well. By employee and or vendor. Invoices have to allow grouping of employee/vendor time and subtotals of each employee/vendor as well! This shows our clients who did what and for how much."
                    ]
                }
            ], 
            "name": "invoice"
        }
    ], 
    "name": "analytics"
}
